class Ex02
{
public static void main(String[] args){ 
	//for  뒤로갈수록 안쓰이는 반복문? 제어가 쉽다=무한루프가 잘안일어남 
                    //현재프로그램은 보통 무한루프상황에서 동작을 많이해 점점 사용성이 줄음
	        //for문은 초기화=>조건식=>반목문=>증감식=> 조건식  식이다 초기화는 무조건 수행된다
	        //증감은 증감식에서만 할수있는게 아니다 반복문에서 컨트롤가능(증감식은 순서에 맟춰실행되는것뿐)

/*
반복문: 누군가는 문법을 쓰기위해 문법을 쓴다. 주니어의 큰 문제점임 '코딩을 위해서 문법을 씀' 반복문의 문법이 등장한
이유는 그냥 편할려고다. 반복은 필요한 경우에만 사용=> 이게 반복을 사용했을때 불필요한 작업이들어간다?
반복은 완벽한 반복이어야한다 필요한 부분만을 반복해야 한다.

아 여러번 같은거 쳐야되네 할 때, 반복할 필요 없는건 빼야한다. 반복이 필요한 완전히 같은 것만

프로그램을 작성할때 문제를 먼저 해석하여 가장 효율적인 규칙을 정립한 후 
반복이 필요한 부분, 아닌 부분을 확실히 구분하자
(작성하기 전에 충분히 생각을 해야된다 문제를 해석 => 공책을 사용하자) 


#무한반복: 같은 작업을 무한히 한다는 것은 불가능하기에 이것은 편의성이 아닌 강제성, 필요성이 생긴다.
단, 이 무한히 반복되는 작업에 탈출할 수 있는 수단이 존재해야 한다(종료)
*/	
}
}
